In [1]:
import pandas as pd
import numpy as np

In [31]:
# importing another data set with numeric data and NaN values -> handle nan value

head = ["ID","Name","Status","Calories","Duration"]
df = pd.read_csv("prac.csv", names = head, header=0)
print(df)

   ID     Name    Status  Calories  Duration
0   1    Alice    Active    2000.0        30
1   2      Bob  Inactive       NaN        45
2   3  Charlie       NaN    1800.0        25
3   4    David       NaN    2200.0        35
4   5      Eve   Running    1900.0        40
5   6    Frank       123    2100.0        50
6   7    Grace      75.5    2050.0        20
7   8   Hannah       NaN       NaN        60
8   9      Ian    Active       NaN        55
9  10     Jane       NaN    2300.0        15

In [32]:
df.dtypes

ID            int64
Name         object
Status       object
Calories    float64
Duration      int64
dtype: object

In [36]:
df.describe(include="all") # include objects also

In [35]:
df.info

In [37]:
# df.replace(np.nan, 0, inplace=True) # chnage orignal data set
df.replace(np.nan, 0) # method with this parameter dont change orignam df and data set

   ID     Name    Status  Calories  Duration
0   1    Alice    Active    2000.0        30
1   2      Bob  Inactive       0.0        45
2   3  Charlie         0    1800.0        25
3   4    David         0    2200.0        35
4   5      Eve   Running    1900.0        40
5   6    Frank       123    2100.0        50
6   7    Grace      75.5    2050.0        20
7   8   Hannah         0       0.0        60
8   9      Ian    Active       0.0        55
9  10     Jane         0    2300.0        15

In [40]:
missing_value = df.isnull()
# to count number of true and false value in missing_value which set from .isnull() to identify NaN values
for column in head:
    print(column)
    print(missing_value[column].value_counts())
    print(" ")

ID
ID
False    10
Name: count, dtype: int64

Name
Name
False    10
Name: count, dtype: int64

Status
Status
False    6
True     4
Name: count, dtype: int64

Calories
Calories
False    7
True     3
Name: count, dtype: int64

Duration
Duration
False    10
Name: count, dtype: int64

# Cleaning this NaN vales as possible
## 1. Drop the Row or Column on the basis of data set
## 2. Replace missing values with mean (if less outliers), meadian (if outliers are more affective), mode (in some case like door in car).
## 3. leave missing data(not recomended)

In [56]:
Cal_avg = df["Calories"].astype('float').mean()
# Cal_med = df["Calories"].astype('float').median()
# Cal_mod = df["Calories"].astype('float').mode()
df.replace({"Calories": Cal_avg}, inplace=True)
print(df)

   ID     Name    Status  Calories  Duration
0   1    Alice    Active    2000.0        30
1   2      Bob  Inactive    2050.0        45
2   3  Charlie       NaN    1800.0        25
3   4    David       NaN    2200.0        35
4   5      Eve   Running    1900.0        40
5   6    Frank       123    2100.0        50
6   7    Grace      75.5    2050.0        20
7   8   Hannah       NaN    2050.0        60
8   9      Ian    Active    2050.0        55
9  10     Jane       NaN    2300.0        15

In [57]:
df = df.dropna(subset=["Status"])
df = df[df["Status"] != ""]

print(df)

   ID   Name    Status  Calories  Duration
0   1  Alice    Active    2000.0        30
1   2    Bob  Inactive    2050.0        45
4   5    Eve   Running    1900.0        40
5   6  Frank       123    2100.0        50
6   7  Grace      75.5    2050.0        20
8   9    Ian    Active    2050.0        55